app/controllers/admin/reservations_controller.rb

SELECT "reservations".* FROM "reservations" ORDER BY "reservations"."created_at" DESC
---
  def index
    @reservations = Reservation.all.order(created_at: :desc)

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @reservation = Reservation.find(params[:id])