app/controllers/admin/sessions_controller.rb

  def create
    admin = AdminUser.find_by(email: params[:email])
---
SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."email" = ? LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]

  def create
    admin = AdminUser.find_by(email: params[:email])
---
SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."email" = ? LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]