app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new(reservation_params)
    if @reservation.save
---
INSERT INTO "reservations" ("name", "email", "date", "time", "guests", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"